---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures
source: html/941cea83-aef8-fe0d-d86b-d8ef563afa49.htm
---
# BuiltInFailures.OpeningFailures Properties

Host can't be cut because it has no geometry.